parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
    display.display();

    return;
}

//TODO: WiFi and NTP Functions
/**
 * @brief Tries to get local time from NTP:
 * -> If it's successful, The year, month, date, hour, minutes, seconds is updated to global variables with time from NTP,
 * and the time is saved to RTC.
 * -> If it fails, the fuction is called rtc_get_time()
 */
void printLocalTime(void)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Updating", "NTP", "");
    Serial.println("Fetching Latest Time from NTP");

    struct tm timeinfo;
    if (!getLocalTime(&timeinfo))
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("NTP", "Update", "Failed");
        Serial.println("NTP Failed to Update");
        rtc_get_time();
        write_error_log(NTP_NOT_UPDATED); // Error Log
        return;
    }

    year = timeinfo.tm_year - 100;
    month = timeinfo.tm_mon + 1;
    date = timeinfo.tm_mday;
    hour = timeinfo.tm_hour;
    minutes = timeinfo.tm_min;
    seconds = timeinfo.tm_sec;

    solid_rgb_ring(GREEN_COLOR);
    update_oled("NTP", "Update", "Success");
    String day = (String)year + '/' + (String)month + '/' + (String)date;
    String time = (String)hour + ':' + (String)minutes + ':' + (String)seconds;
    Serial.println("Time from NTP:\n" + day + ' ' + time);
    update_oled("NTP Time", day, time);
    delay(1000);

    solid_rgb_ring(YELLOW_COLOR);
    update_oled("RTC", "Update", "In Progress");
    rtc.adjust(DateTime(year, month, date, hour, minutes, seconds));

    solid_rgb_ring(GREEN_COLOR);
    update_oled("RTC", "Update", "Successful");
    return;
}

void notFound(AsyncWebServerRequest *request)
{
    request->send(404, "text/plain", "Not found");
}

/**
 * @brief Setup ESP as WiFi Router and get new login credentials
 * Reference: https://randomnerdtutorials.com/esp32-esp8266-input-data-html-form/
 */
void connect_to_new_wifi(void)
{
    update_oled("Connect", "To New", "WiFi");
    delay(500);

    deleteFile(SD, SSID_FILE);
    deleteFile(SD, PASSWORD_FILE);

    WiFi.mode(WIFI_AP);
    String soft_ap_config = WiFi.softAPConfig(local_IP, gateway, subnet) ? "Ready" : "Failed!";
    Serial.print("Setting soft-AP configuration ... ");
    Serial.println(soft_ap_config);

    String soft_ap_connect = WiFi.softAP(esp32_ssid) ? "Ready" : "Failed!";
    Serial.print("Setting soft-AP ... ");
    Serial.println();

    Serial.print("IP Address: " + WiFi.softAPIP());
    update_oled("Connect to:", "192.168.4.22", "");
    // Send web page with input fields to client
    server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
              { request->send_P(200, "text/html", index_html); });
    delay(5000);

    server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
              { request->send_P(200, "text/html", index_html); });

    server.on("/get", HTTP_GET, [](AsyncWebServerRequest *request)
              {
                  String input_message;
                  String input_parameter;

                  if (request->hasParam(input_parameter1))
                  {
                      input_message = request->getParam(input_parameter1)->value();
                      input_parameter = input_parameter1;

                      char sd_ssid[SSID_CHAR_LENGTH];
                      String("SSID Length: " + input_message.length());
                      for (int i = 0; i < input_message.length(); i++)
                          sd_ssid[i] = input_message[i];
                      Serial.println("Save SSID: " + (String)sd_ssid);
                      writeFile(SD, SSID_FILE, sd_ssid);
                  }
                  else if (request->hasParam(input_parameter2))
                  {
                      input_message = request->getParam(input_parameter2)->value();
                      input_parameter = input_parameter2;
                      char sd_password[PASSWORD_CHAR_LENGTH];
                      String("Password Length: " + input_message.length());
                      for (int i = 0; i < input_message.length(); i++)
                          sd_password[i] = input_message[i];
                      Serial.println("Save Password: " + (String)sd_password);
                      writeFile(SD, PASSWORD_FILE, sd_password);
                  }
                  else
                  {
                      input_message = "No message sent";
                      input_parameter = "none";
                  }
                  Serial.println(input_message);
              });
    server.onNotFound(notFound);
    server.begin();
    while (1)
    {
    }
    WiFi.softAPdisconnect();
}

//TODO: RTC Functions
/**
 * @brief Fetch Time from RTC and save it in global time variables
 * 
 */
void rtc_get_time(void)
{
    Serial.println("Fetching Time from RTC");
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("RTC", "Update", "In Progress");

    DateTime now = rtc.now();
    solid_rgb_ring(GREEN_COLOR);
    Serial.println("RTC Fetch Successful");
    update_oled("RTC", "Fetch", "Successful");

    year = now.year();
    month = now.month();
    seconds = now.second();
    hour = now.hour();
    minutes = now.minute();
    seconds = now.second();

    String day = (String)year + '/' + (String)month + '/' + (String)date;
    String time = (String)hour + ':' + (String)minutes + ':' + (String)seconds;
    Serial.println("Time from RTC:\n" + day + ' ' + time);
    update_oled("RTC Time", day, time);
    delay(1000);

    solid_rgb_ring(GREEN_COLOR);
    update_oled("RTC", "Update", "Successful");
    return;
}

//TODO: RGB NeoPixel Functions
/**
 * @brief Setting the RGB Ring Light to a solid color
 * 
 * @param color pixels.Color(R:0-255, G:0-255, B:0-255)
 */
void solid_rgb_ring(uint32_t color)
{
    Serial.println("Setting up RGB Color");
    pixels.clear();
    for (size_t i = 0; i < NUMPIXELS; i++)
        pixels.setPixelColor(i, color);
    pixels.show();
    return;
}

/**
 * @brief Setting the LED Ring light one led at time to display progress bar on the pixel ring.
 * 
 * @param led_number LED Ring Number
 */
void halt_rgb_ring(int led_number)
{
    pixels.clear();
    led_number = led_number % NUMPIXELS;
    pixels.setPixelColor(led_number, YELLOW_COLOR);
    pixels.show();
    return;
}

//TODO: MicroSD Card Functions3
/**
 * @brief List All the Available Directories
 * 
 * @param fs 
 * @param dirname 
 * @param levels 
 */
void listDir(fs::FS &fs, const char *dirname, uint8_t levels)
{
    Serial.printf("Listing directory: %s\n", dirname);

    File root = fs.open(dirname);
    if (!root)
    {
        Serial.println("Failed to open directory");
        return;
    }
    if (!root.isDirectory())
    {
        Serial.println("Not a directory");
        return;
    }

    File file = root.openNextFile();
    while (file)
    {
        if (file.isDirectory())
        {
            Serial.print("  DIR : ");
            Serial.println(file.name());
            if (levels)
            {
                listDir(fs, file.name(), levels - 1);
            }
        }
        else
        {
            Serial.print("  FILE: ");
            Serial.print(file.name());
            Serial.print("  SIZE: ");
            Serial.println(file.size());
        }
        file = root.openNextFile();
    }
}

/**
 * @brief Create a Directory on SD Card
 * 
 * @param fs SD Object
 * @param path The Location Path of the folder
 */
void createDir(fs::FS &fs, const char *path)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Creating", "Dir. in", "MicroSD");
    Serial.printf("Creating Dir: %s\n", path);
    if (fs.mkdir(path))
    {
        Serial.println("Dir created");
        solid_rgb_ring(GREEN_COLOR);
        update_oled("Dir.", "Create", "Successful");
    }
    else
    {
        Serial.println("mkdir failed");
        solid_rgb_ring(RED_COLOR);
        update_oled("Dir.", "Create", "Failed");
    }
    return;
}

/**
 * @brief Delete the File
 * 
 * @param fs SD Object
 * @param path 
 */
void deleteFile(fs::FS &fs, const char *path)
{
    Serial.printf("Deleting file: %s\n", path);
    if (fs.remove(path))
    {
        Serial.println("File deleted");
    }
    else
    {
        Serial.println("Delete failed");
    }
}

/**
 * @brief Read a file on SD Card
 * 
 * @param fs SD Object
 * @param path The Location path of the file
 * @return int Exit Status
 */
void readFile(fs::FS &fs, const char *path)
{
    String read_line = "";
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Reading", "File from", "MicroSD");
    Serial.printf("Reading file: %s\n", path);

    File file = fs.open(path);
    if (!file)
    {
        Serial.println("Failed to open file for reading");
        solid_rgb_ring(RED_COLOR);
        update_oled("File", "Open", "Failed");
    }

    Serial.print("Read from file: ");
    while (file.available())
        read_line = file.read();
    file.close();
    solid_rgb_ring(GREEN_COLOR);
    update_oled("File", "Read", "Successful");
}

/**
 * @brief Write to a file on SD Card
 * 
 * @param fs SD Object
 * @param path Path of the file
 * @param message Message to be written in the file
 */
void writeFile(fs::FS &fs, const char *path, const char *message)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Writing", "File to", "MicroSD");
    Serial.printf("Writing file: %s\n", path);

    File file = fs.open(path, FILE_WRITE);
    if (!file)
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("File", "Not", "Available");
        Serial.println("Failed to open file for writing");
        return;
    }
    if (file.print(message))
    {
        solid_rgb_ring(GREEN_COLOR);
        update_oled("File", "Write", "Successful");
        Serial.println("File written");
    }
    else
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("File", "Write", "Failed");
        Serial.println("Write failed");
    }
    file.close();
    return;
}

/**
 * @brief Append the message to the file
 * -> If file doesn't exist, then a new file is created and then written to it.
 * 
 * @param fs SD Object
 * @param path Path of the file
 * @param message Message to be written to the file
 */
void appendFile(fs::FS &fs, const char *path, const char *message)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Appending", "File to", "MicroSD");
    Serial.printf("Appending to file: %s\n", path);

    File file = fs.open(path, FILE_APPEND);
    if (!file)
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("File", "Not", "Available");
        Serial.println("Failed to open file for appending");
        writeFile(SD, path, message);
        return;
    }
    if (file.print(message))
    {
        solid_rgb_ring(GREEN_COLOR);
        update_oled("Message", "Append", "Successful");
        Serial.println("Message appended");
    }
    else
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("Message", "Append", "Failed");
        Serial.println("Append failed");
    }
    file.close();
    return;
}

