parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
        // Reading the data from EEPROM about previously connected boxes
        connected_boxes = EEPROM.read(CONNECTED_BOXES_STORED_LOCATION);
        connected_boxes++;
        EEPROM.write(CONNECTED_BOXES_STORED_LOCATION, connected_boxes);
        EEPROM.commit();

        // Creating char array where the data in format<box_id><box_communication_address> is saved
        char sd_message[BOX_ID_LENGTH + COMMUNICATION_ID_LENGTH + dt.length()];
        for (int i = 0; i < (BOX_ID_LENGTH + COMMUNICATION_ID_LENGTH + dt.length()); i++)
        {
            if (i < BOX_ID_LENGTH)
                sd_message[i] = box_id[i];
            else if (i < COMMUNICATION_ID_LENGTH)
                sd_message[i] = address[i - BOX_ID_LENGTH];
            else
                sd_message[i] = dt[i];
        }

        appendFile(SD, BOX_ID_DETAILS_FILE, sd_message); // Appending the char array in SD Card
        read_box_details_from_sd_card();                 // Updating the box data and saving the new box in Box ID Array
        solid_rgb_ring(GREEN_COLOR);
        update_oled("Added", "New Box", box_id);
    }
    else // FALSE
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("Failed", "New Box", box_id);
    }

    // Uploading the data in AWS
    if (!client.connected())
        checkWiFiThenMQTT();
    else
    {
        client.loop();
        send_Success_Data((String)box_id, "add", connection_status, (String)address, "", "");
    }
    return;
}

/**
 * @brief Calibrate the Box
 * Box is calibrated in the following method:
 * 1. NRF is set to the box_address as recieved, and the message "cali,<box_id>" is sent.
 * 2. Checks if recieved message is in the format "cali,ok":
 * 2.1 If message is not in format, AWS is notified.
 * 2.2 If message is in format, AWS is notified, delay of 30 sec is waited.
 * 2.2.1 After the delay of 30 secs, write to radio for the updated calibration data with message "calibration_data_update"
 * 2.2.2 Read the recieved message from NRF for the updated values
 * 2.2.3 
 * 
 * @param box_id Box ID
 * @param box_address Box Communication Address
 */
void calibrate_box(String box_id, String box_address)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Calibrating", "Box", box_id);

    char address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < COMMUNICATION_ID_LENGTH; i++)
        address[i] = box_address[i];

    // Writing the NRF with message "cali,<box_id>"
    String message = "cali," + box_id;
    write_radio(address, message);

    // Check if the message recieved is in required format or not
    String recieved_message = read_radio(address);
    int connection_status = 0; // 0 -> Failure, 1 -> Success

    // Check if the NRF connection was successful or not
    if (recieved_message = ("cali,ok"))
    {
        connection_status = 1;
        solid_rgb_ring(GREEN_COLOR);
        update_oled("Calibration", "Connect", "Successful");
    }
    else
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("Calibration", "Connect", "Failed");
    }

    // AWS is contacted and updated if calibration is successful or not
    if (!client.connected())
        checkWiFiThenMQTT();
    else
    {
        client.loop();
        send_Success_Data((String)box_id, "calibrate", connection_status, "", "", "");
    }

    if (connection_status == 1)
    {
        delay(30 * 1000);                                // Wait for calibration to complete
        write_radio(address, "calibration_data_update"); // Write to radio fpr updated values
        String update_message = read_radio(address);     // Read the radio
        if (update_message != "")                        // Check if the radio message is not empty
        {
            solid_rgb_ring(GREEN_COLOR);
            update_oled("Calibration", "Successful", box_id);
        }
        else
        {
            connection_status = 0;
            solid_rgb_ring(RED_COLOR);
            update_oled("Calibration", "Failed", box_id);
        }

        if (!client.connected())
            checkWiFiThenMQTT();
        else
        {
            client.loop();
            send_Success_Data((String)box_id, "calibration_update", connection_status, update_message, "", "");
        }
    }
    return;
}

/**
 * @brief Contact the Boxes to collect the data from it
 * 
 * @param box_id 
 * @param box_address 
 */
void update_box_data(String box_id, String box_address)
{
    char address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < COMMUNICATION_ID_LENGTH; i++)
        address[i] = box_address[i];

    // Write radio with the address recieved
    String write_message = "updt";
    write_radio(address, write_message);

    // Read the radio
    String message = read_radio(address);
    if (message != "")
    { // Correct format: "<count>,<temperature>,<battery>,<offset>,<average_wesight>"

        String str_sd_message = hour + '/' + minutes + '/' + seconds + box_id + message;
        int msg_size = str_sd_message.length(); // Calculating the message size
        char sd_message[msg_size];              // Str to Char conversion
        for (int i = 0; i < msg_size; i++)
            sd_message[i] = str_sd_message[i];

        // Creating Directory of Format YYYY/MM/
        String str_dir = '/' + (String)year + '/' + (String)month;
        int dir_size = str_dir.length();
        char dir[dir_size]; // Str to Char conversion
        for (int i = 0; i < dir_size; i++)
            dir[i] = str_dir[i];
        createDir(SD, dir);

        // Creating File Path
        String str_file_path = '/' + (String)year + '/' + (String)month + '/' + (String)date + file_extension;
        int path_size = str_file_path.length();
        char file_path[path_size]; // Str to Char conversion
        for (int i = 0; i < path_size; i++)
            file_path[i] = str_file_path[i];
        appendFile(SD, file_path, sd_message);

        if (wifi_connection_status == 1)
        {
            if (!client.connected())
                checkWiFiThenMQTT();
            else
            {
                client.loop();
                sendData(box_id, message);
            }
        }
        else
            appendFile(SD, AWS_BACKLOG_FILE, sd_message);
    }
}

/**
 * @brief Change Box Settings
 * 
 * @param box_id 
 * @param box_address 
 * @param dt 
 * @param st 
 * @param bt 
 */
void change_box_setting(String box_id, String box_address, String dt, String st, String bt)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Change", "Setting", box_id);
    int success_code = 0;

    char address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < COMMUNICATION_ID_LENGTH; i++)
        address[i] = box_address[i];

    String message = "chng," + dt + st + bt;
    write_radio(address, message);

    String recieved_message = read_radio(address);
    if (recieved_message == "chng,ok")
    {
        success_code = 1;
        solid_rgb_ring(GREEN_COLOR);
        update_oled("Setting", "Successful", box_id);
    }
    else
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("Setting", "Failed", box_id);
    }

    // Update to AWS
    if (!client.connected())
        checkWiFiThenMQTT();
    else
    {
        client.loop();
        send_Success_Data(box_id, "change", success_code, dt, st, bt);
    }
}

/**
 * @brief Buzz the box
 * 
 * @param box_id 
 * @param box_address 
 */
void sound_buzzer(String box_id, String box_address)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Buzz", "Box", box_id);

    char address[COMMUNICATION_ID_LENGTH];
    for (int i = 0; i < COMMUNICATION_ID_LENGTH; i++)
        address[i] = box_address[i];

