parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
    writeFile(SD, ERROR_LOG_FILE, error_log);
}

//TODO: AWS Functions

/**
 * @brief This function is activated when the message is recieved from AWS
 * 
 * @param topic 
 * @param payload 
 */
void messageReceived(String &topic, String &payload)
{
    timerStop(timer);
    timerAlarmDisable(timer);
    //Reference (JSON to String Converter): https://github.com/bblanchon/ArduinoJson/blob/6.x/examples/JsonParserExample/JsonParserExample.ino
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Message", "Recieved", "from AWS");

    Serial.println("Recieved [" + topic + "]: " + payload);

    StaticJsonDocument<50> doc;
    DeserializationError error = deserializeJson(doc, payload);

    if (error)
    {
        Serial.print(F("deserializeJson() failed: "));
        Serial.println(error.f_str());
        return;
    }

    String box_id = doc["boxid"];
    String cmd = doc["cmd"];

    // Perform action as per the command from AWS
    if (cmd == "add") // Add new Box
    {
        String dt = doc["dt"];
        add_new_box(box_id, dt);
    }
    else if (cmd == "calibrate") //Calibrate box parameters
    {
        String address = fetch_box_address(box_id);
        calibrate_box(box_id, address);
    }
    else if (cmd == "ask") //Ask box for updated values
    {
        rtc_get_time();
        String address = fetch_box_address(box_id);
        solid_rgb_ring(YELLOW_COLOR);
        update_oled("Update", "Box", "In Progress");
        update_box_data(box_id, address);
        solid_rgb_ring(GREEN_COLOR);
        update_oled("Update", "Box", "Successful");
    }
    else if (cmd == "change_setting") // Change box settings
    {
        String dt = doc["dt"];
        String st = doc["st"];
        String bt = doc["bt"];
        String address = fetch_box_address(box_id);
        change_box_setting(box_id, address, dt, st, bt);
    }
    else if (cmd == "buzz")
    {
        String address = fetch_box_address(box_id);
        sound_buzzer(box_id, address);
    }

    solid_rgb_ring(GREEN_COLOR);
    update_oled("AWS", "MSG Recieved", "Complete");
    timerStart(timer);
    timerAlarmEnable(timer);
}

void lwMQTTErr(lwmqtt_err_t reason)
{
    if (reason == lwmqtt_err_t::LWMQTT_SUCCESS)
        Serial.print("Success");
    else if (reason == lwmqtt_err_t::LWMQTT_BUFFER_TOO_SHORT)
    {
        write_error_log("#002");
        Serial.print("Buffer too short");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_VARNUM_OVERFLOW)
    {
        write_error_log("#003");
        Serial.print("Varnum overflow");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_FAILED_CONNECT)
    {
        write_error_log("#004");
        Serial.print("Network failed connect");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_TIMEOUT)
    {
        write_error_log("#005");
        Serial.print("Network timeout");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_FAILED_READ)
    {
        write_error_log("#006");
        Serial.print("Network failed read");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_FAILED_WRITE)
    {
        write_error_log("#007");
        Serial.print("Network failed write");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_REMAINING_LENGTH_OVERFLOW)
    {
        write_error_log("#008");
        Serial.print("Remaining length overflow");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_REMAINING_LENGTH_MISMATCH)
    {
        write_error_log("#009");
        Serial.print("Remaining length mismatch");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_MISSING_OR_WRONG_PACKET)
    {
        write_error_log("#010");
        Serial.print("Missing or wrong packet");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_CONNECTION_DENIED)
    {
        write_error_log("#011");
        Serial.print("Connection denied");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_FAILED_SUBSCRIPTION)
    {
        write_error_log("#012");
        Serial.print("Failed subscription");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_SUBACK_ARRAY_OVERFLOW)
    {
        write_error_log("#013");
        Serial.print("Suback array overflow");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_PONG_TIMEOUT)
    {
        write_error_log("#014");
        Serial.print("Pong timeout");
    }
}

void lwMQTTErrConnection(lwmqtt_return_code_t reason)
{
    if (reason == lwmqtt_return_code_t::LWMQTT_CONNECTION_ACCEPTED)
        Serial.print("Connection Accepted");
    else if (reason == lwmqtt_return_code_t::LWMQTT_UNACCEPTABLE_PROTOCOL)
    {
        write_error_log("#015");
        Serial.print("Unacceptable Protocol");
    }
    else if (reason == lwmqtt_return_code_t::LWMQTT_IDENTIFIER_REJECTED)
    {
        write_error_log("#016");
        Serial.print("Identifier Rejected");
    }
    else if (reason == lwmqtt_return_code_t::LWMQTT_SERVER_UNAVAILABLE)
    {
        write_error_log("#017");
        Serial.print("Server Unavailable");
    }
    else if (reason == lwmqtt_return_code_t::LWMQTT_BAD_USERNAME_OR_PASSWORD)
    {
        write_error_log("#018");
        Serial.print("Bad UserName/Password");
    }
    else if (reason == lwmqtt_return_code_t::LWMQTT_NOT_AUTHORIZED)
    {
        write_error_log("#019");
        Serial.print("Not Authorized");
    }
    else if (reason == lwmqtt_return_code_t::LWMQTT_UNKNOWN_RETURN_CODE)
    {
        write_error_log("#020");
        Serial.print("Unknown Return Code");
    }
}

void connectToMqtt(bool nonBlocking)
{
    Serial.print("MQTT connecting ");
    while (!client.connected())
    {
        if (client.connect(THINGNAME))
        {
            Serial.println("connected!");
            if (!client.subscribe(MQTT_SUB_TOPIC))
                lwMQTTErr(client.lastError());
        }
        else
        {
            Serial.print("SSL Error Code: ");
            //  Serial.println(net.getLastSSLError());
            Serial.print("failed, reason -> ");
            lwMQTTErrConnection(client.returnCode());
            if (!nonBlocking)
            {
                Serial.println(" < try again in 5 seconds");
                delay(5000);
            }
            else
            {
                Serial.println(" <");
            }
        }
        if (nonBlocking)
            break;
    }
}

void connectToWiFi(String init_str)
{
    if (init_str != emptyString)
        Serial.print(init_str);
    while (WiFi.status() != WL_CONNECTED)
    {
        Serial.print(".");
        delay(1000);
    }
    if (init_str != emptyString)
        Serial.println("ok!");
}

void checkWiFiThenMQTT(void)
{
    connectToWiFi("Checking WiFi");
    connectToMqtt(false);
}

